# EnergyDataSettings Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EnergyDataSettings Methods
EnergyDataSettings Class See Also
---
The EnergyDataSettings type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
| CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
| CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
| CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
| CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
| ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
| CheckAnalysisType | Checks that the analysis type falls within an appropriate range. |
| CheckBuildingConstructionClass | Checks that the building construction class falls within an appropriate range. |
| CheckBuildingEnvelope | Checks that the building envelope determination method falls within an appropriate range. |
| CheckBuildingHVACSystem | Checks that the building HVAC system falls within an appropriate range. |
| CheckBuildingOperatingSchedule | Checks that the building operating schedule falls within an appropriate range. |
| CheckBuildingType | Checks that the building type falls within an appropriate range. |
| CheckConstructionSetElement | Checks that the construction set ElementId is acceptable. |
| CheckExportCategory | Checks whether the export category falls within the list: |

  1. OST_Rooms
  2. OST_MEPSpaces

| CheckExportComplexity|  Checks that the export complexity falls within an appropriate range.
| CheckGroundPlane(ElementId)|  The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
| CheckGroundPlane(Document, ElementId)|  The ground plane should be an Element of type Level. This method checks to confirm that an ElementId is for a Level element.
| CheckProjectPhase|  Checks that the input element is a project phase.
| CheckProjectReportType|  Checks that the project report type falls within an appropriate range.
| CheckRangeOfPercentageGlazing|  Checks that the percentage glazing value is between 0.00 and 0.95.
| CheckRangeOfPercentageSkylights|  Checks that the percentage skylights value is between 0.00 and 0.95.
| CheckRangeOfShadeDepth|  Checks that the shade depth is greater than or equal to zero.
| CheckRangeOfSillHeight|  Checks that the sill height is greater than or equal to zero.
| CheckRangeOfSkylightWidth|  Checks that the skylight width is greater than or equal to eight inches.
| CheckRangeOfSliverSpaceTolerance|  Checks that the sliver space tolerance is greater than or equal to zero.
| CheckServiceType|  Checks that the service type falls within an appropriate range.
| DeleteEntity|  Deletes the existing entity created by %schema% in the element  (Inherited from Element.)
| DeleteSubelement|  Removes a subelement from the element.  (Inherited from Element.)
| DeleteSubelements|  Removes the subelements from the element.  (Inherited from Element.)
| Dispose|  (Inherited from Element.)
| Equals| Determines whether the specified Object is equal to the current Object. (Inherited from Object.)
| EvaluateAllParameterValues|  Evaluates all the parameters' values of the element.  (Inherited from Element.)
| EvaluateParameterValues|  Evaluate the parameters' values of the element on the given parameter ID set.  (Inherited from Element.)
| GetBuildingConstructionSetElementId|  Id of the building construction set.
| GetDependentElements|  Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.)
| GetEntity|  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.)
| GetEntitySchemaGuids|  Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.)
| GetExternalFileReference|  Gets information pertaining to the external file referenced by the element.  (Inherited from Element.)
| GetExternalResourceReference|  Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.)
| GetExternalResourceReferenceExpanded|  Gets the collection of ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.)
| GetExternalResourceReferences|  Gets the map of the external resource references referenced by the element.  (Inherited from Element.)
| GetExternalResourceReferencesExpanded|  Gets the expanded map of the external resource references referenced by the element.  (Inherited from Element.)
| GetFromDocument|  Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.
| GetGeneratingElementIds|  Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.)
| GetGeometryObjectFromReference|  Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.)
| GetHashCode| Serves as a hash function for a particular type.  (Inherited from Object.)
| GetMaterialArea|  Gets the area of the material with the given id.  (Inherited from Element.)
| GetMaterialIds|  Gets the element ids of all materials present in the element.  (Inherited from Element.)
| GetMaterialVolume|  Gets the volume of the material with the given id.  (Inherited from Element.)
| GetMonitoredLinkElementIds|  Provides the link instance IDs when the element is monitoring.  (Inherited from Element.)
| GetMonitoredLocalElementIds|  Provides the local element IDs when the element is monitoring.  (Inherited from Element.)
| GetOrderedParameters|  Gets the parameters associated to the element in order.  (Inherited from Element.)
| GetParameter| Retrieves a parameter from the element given identifier. (Inherited from Element.)
| GetParameterFormatOptions|  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.)
| GetParameters| Retrieves the parameters from the element via the given name. (Inherited from Element.)
| GetPhaseStatus|  Gets the status of a given element in the input phase  (Inherited from Element.)
| GetReportsFolderParsed|  Gets the absolute reports folder path that is parsed from the original input.
| GetSubelements|  Returns the collection of element subelements.  (Inherited from Element.)
| GetType| Gets the Type of the current instance. (Inherited from Object.)
| GetTypeId|  Returns the identifier of this element's type.  (Inherited from Element.)
| GetValidTypes()()()()|  Obtains a set of types that are valid for this element.  (Inherited from Element.)
| HasPhases|  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.)
| IsCreatedPhaseOrderValid|  Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.)
| IsDemolishedPhaseOrderValid|  Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.)
| IsDocumentUsingEnergyDataAnalyticalModel|  Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
| IsExternalFileReference|  Determines whether this Element represents an external file.  (Inherited from Element.)
| IsHidden| Identifies if the element has been permanently hidden in the view. (Inherited from Element.)
| IsMonitoringLinkElement|  Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.)
| IsMonitoringLocalElement|  Indicate whether an element is monitoring other local elements.  (Inherited from Element.)
| IsPhaseCreatedValid|  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.)
| IsPhaseDemolishedValid|  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.)
| IsValidType(ElementId)|  Checks if given type is valid for this element.  (Inherited from Element.)
| LookupParameter| Attempts to find a parameter on the element which has the given name. (Inherited from Element.)
| RefersToExternalResourceReference|  Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.)
| RefersToExternalResourceReferences|  Determines whether this Element uses external resources.  (Inherited from Element.)
| SetEntity|  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.)
| SetReportsFolder|  Sets the reports folder path.
| ToString| Returns a string that represents the current object. (Inherited from Object.)
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace